cases/runs/elbow90d_fine__20251126-112800__refinedmesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          365;
        startFace       1207242;
    }
    outlet
    {
        type            patch;
        nFaces          331;
        startFace       1207607;
    }
    wall
    {
        type            wall;
        nFaces          40948;
        startFace       1207938;
    }
)

// ************************************************************************* //
