cases/runs/elbow90d_fine__20251126-112800__refinedmesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  Field          | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   Operation      | Version:  11                                    |
|   \\  /    And            |                                                 |
|    \\/     Manipulation   |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0;
        smoother            DICGaussSeidel;
        nPreSweeps          0;
        nPostSweeps         2;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 10;
        agglomerator        faceAreaPair;
        mergeLevels         1;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 4;
    consistent      yes;

    residualControl
    {
        p               5e-4;
        U               1e-5;
        "(k|omega)"     1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p       0.2;
    }
    equations
    {
        U       0.5;
        k       0.5;
        omega   0.5;
    }
}

// ************************************************************************* //
